package it.polimi.it.galaxytrucker.view.CLI;

import java.util.HashMap;
import java.util.List;

public class AdventureCardASCII {
    private final HashMap<String, List<String>> asciiCards = new HashMap<>();

    public AdventureCardASCII() {
        asciiCards.put("GT-cards_1_01.jpg",
                List.of(
                        "╔═════ SLAVERS ════╗",
                        "║                  ║",
                        "║      🔫 ►  6     ║",
                        "║                  ║",
                        "║      👨 ► -3     ║",
                        "║                  ║",
                        "║      💵 ► +5     ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_012.jpg",
                List.of(
                        "╔═══ SMUGGLERS ════╗",
                        "║                  ║",
                        "║      🔫 ►  4     ║",
                        "║                  ║",
                        "║      📦 ► -2     ║",
                        "║                  ║",
                        "║      🟨🟩🟦       ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_013.jpg",
                List.of(
                        "╔═══ SMUGGLERS ════╗",
                        "║                  ║",
                        "║      🔫 ►  5     ║",
                        "║                  ║",
                        "║     ⬇️ 💥⬇️ ⬇️    ║",
                        "║                  ║",
                        "║      💵 ► +4     ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_014.jpg",
                List.of(
                        "╔════ STAR DUST ═══╗",
                        "║                  ║",
                        "║ DOUBLE:  📅 ► -1 ║",
                        "║ TRIPLE:  📅 ► -1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        "",
                        ""
                ));
        asciiCards.put("GT-cards_1_015.jpg",
                List.of(
                        "╔═══ OPEN SPACE ═══╗",
                        "║                  ║",
                        "║ ENGINE:  📅 ► +1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_016.jpg",
                List.of(
                        "╔═══ OPEN SPACE ═══╗",
                        "║                  ║",
                        "║ ENGINE:  📅 ► +1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_017.jpg",
                List.of(
                        "╔═══ OPEN SPACE ═══╗",
                        "║                  ║",
                        "║ ENGINE:  📅 ► +1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_018.jpg",
                List.of(
                        "╔═══ OPEN SPACE ═══╗",
                        "║                  ║",
                        "║ ENGINE:  📅 ► +1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_019.jpg",
                List.of(
                        "╔══ METEOR SWARM ══╗",
                        "║                  ║",
                        "║      💥⬇️ ► 1     ║",
                        "║       ➡️ ► 1     ║",
                        "║       ⬅️ ► 1     ║",
                        "║       ⬆️ ► 0     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0110.jpg",
                List.of(
                        "╔══ METEOR SWARM ══╗",
                        "║                  ║",
                        "║       ⬇️ ► 2     ║",
                        "║       ➡️ ► 1     ║",
                        "║       ⬅️ ► 1     ║",
                        "║       ⬆️ ► 1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0111.jpg",
                List.of(
                        "╔══ METEOR SWARM ══╗",
                        "║                  ║",
                        "║      💥⬇️ ► 1     ║",
                        "║       ⬇️ ► 1     ║",
                        "║      💥⬇️ ► 1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0112.jpg",
                List.of(
                        "╔════ PLANETS ═════╗",
                        "║                  ║",
                        "║ 1️⃣: 🟥🟩🟦🟦🟦    ║",
                        "║ 2️⃣: 🟥🟨🟦        ║",
                        "║ 3️⃣: 🟥🟦🟦🟦      ║",
                        "║ 4️⃣: 🟥🟩          ║",
                        "║                  ║",
                        "║      📅 ► -3     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0113.jpg",
                List.of(
                        "╔════ PLANETS ═════╗",
                        "║                  ║",
                        "║ 1️⃣: 🟥🟥          ║",
                        "║ 2️⃣: 🟥🟦🟦        ║",
                        "║ 3️⃣: 🟨            ║",
                        "║                  ║",
                        "║      📅 ► -2     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0114.jpg",
                List.of(
                        "╔════ PLANETS ═════╗",
                        "║                  ║",
                        "║ 1️⃣: 🟨🟩🟦🟦      ║",
                        "║ 2️⃣: 🟨🟨          ║",
                        "║                  ║",
                        "║      📅 ► -3     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0115.jpg",
                List.of(
                        "╔════ PLANETS ═════╗",
                        "║                  ║",
                        "║ 1️⃣: 🟩🟩          ║",
                        "║ 2️⃣: 🟨            ║",
                        "║ 3️⃣: 🟦🟦🟦        ║",
                        "║                  ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0116.jpg",
                List.of(
                        "╔══ COMBAT ZONE ═══╗",
                        "║                  ║",
                        "║   ↓👨 : 📅 ► -1   ║",
                        "║   ↓🚀 : 👨 ► -2   ║",
                        "║   ↓🔫 : ⬆️ 💥⬆️    ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0117.jpg",
                List.of(
                        "╔═ ABANDONED SHIP ═╗",
                        "║                  ║",
                        "║      👨 ► -2     ║",
                        "║      💵 ► +3     ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0118.jpg",
                List.of(
                        "╔═ ABANDONED SHIP ═╗",
                        "║                  ║",
                        "║      👨 ► -3     ║",
                        "║      💵 ► +4     ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0119.jpg",
                List.of(
                        "╔═ ABAND. STATION ═╗",
                        "║                  ║",
                        "║      👨 ► ≥5     ║",
                        "║                  ║",
                        "║        🟩🟨       ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_1_0120.jpg",
                List.of(
                        "╔═ ABAND. STATION ═╗",
                        "║                  ║",
                        "║      👨 ► ≥6     ║",
                        "║                  ║",
                        "║        🟥🟥       ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        "",
                        ""
                ));
        asciiCards.put("GT-cards_2_01.jpg",
                List.of(
                        "╔═════ SLAVERS ════╗",
                        "║                  ║",
                        "║      🔫 ►  7     ║",
                        "║                  ║",
                        "║      👨 ► -4     ║",
                        "║                  ║",
                        "║      💵 ► +8     ║",
                        "║      📅 ► -2     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_012.jpg",
                List.of(
                        "╔═══ SMUGGLERS ════╗",
                        "║                  ║",
                        "║      🔫 ►  8     ║",
                        "║                  ║",
                        "║      📦 ► -3     ║",
                        "║                  ║",
                        "║      🟥🟨🟨       ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_013.jpg",
                List.of(
                        "╔═════ PIRATES ════╗",
                        "║                  ║",
                        "║      🔫 ►  6     ║",
                        "║                  ║",
                        "║    💥⬇️ ⬇️ 💥⬇️     ║",
                        "║                  ║",
                        "║      💵 ► +7     ║",
                        "║      📅 ► -2     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_014.jpg",
                List.of(
                        "╔════ STAR DUST ═══╗",
                        "║                  ║",
                        "║ DOUBLE:  📅 ► -1 ║",
                        "║ TRIPLE:  📅 ► -1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_015.jpg",
                List.of(
                        "╔════ EPIDEMIC ════╗",
                        "║                  ║",
                        "║ Remove 1 cremate ║",
                        "║ from each adjac- ║",
                        "║ ent cabin.       ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_016.jpg",
                List.of(
                        "╔═══ OPEN SPACE ═══╗",
                        "║                  ║",
                        "║ ENGINE:  📅 ► +1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_017.jpg",
                List.of(
                        "╔═══ OPEN SPACE ═══╗",
                        "║                  ║",
                        "║ ENGINE:  📅 ► +1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_018.jpg",
                List.of(
                        "╔═══ OPEN SPACE ═══╗",
                        "║                  ║",
                        "║ ENGINE:  📅 ► +1 ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_019.jpg",
                List.of(
                        "╔══ METEOR SWARM ══╗",
                        "║                  ║",
                        "║       ⬇️ ► 2     ║",
                        "║      💥➡️ ► 1     ║",
                        "║       ➡️ ► 2     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0110.jpg",
                List.of(
                        "╔══ METEOR SWARM ══╗",
                        "║                  ║",
                        "║      💥⬇️ ► 2     ║",
                        "║       ⬆️ ► 2     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0111.jpg",
                List.of(
                        "╔══ METEOR SWARM ══╗",
                        "║                  ║",
                        "║       ⬇️ ► 2     ║",
                        "║      💥⬅️ ► 1     ║",
                        "║       ⬅️ ► 2     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0112.jpg",
                List.of(
                        "╔════ PLANETS ═════╗",
                        "║                  ║",
                        "║ 1️⃣: 🟥🟥🟥🟨      ║",
                        "║ 2️⃣: 🟥🟥🟩🟩      ║",
                        "║ 3️⃣: 🟥🟦🟦🟦🟦    ║",
                        "║                  ║",
                        "║      📅 ► -4     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0113.jpg",
                List.of(
                        "╔════ PLANETS ═════╗",
                        "║                  ║",
                        "║ 1️⃣: 🟥🟥          ║",
                        "║ 2️⃣: 🟩🟩🟩🟩      ║",
                        "║                  ║",
                        "║      📅 ► -3     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0114.jpg",
                List.of(
                        "╔════ PLANETS ═════╗",
                        "║                  ║",
                        "║ 1️⃣: 🟥🟨          ║",
                        "║ 2️⃣: 🟨🟩🟦        ║",
                        "║ 3️⃣: 🟩🟩          ║",
                        "║ 4️⃣: 🟨            ║",
                        "║                  ║",
                        "║      📅 ► -2     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0115.jpg",
                List.of(
                        "╔════ PLANETS ═════╗",
                        "║                  ║",
                        "║ 1️⃣: 🟩🟩🟩🟩      ║",
                        "║ 2️⃣: 🟨🟨          ║",
                        "║ 3️⃣: 🟦🟦🟦🟦      ║",
                        "║                  ║",
                        "║      📅 ► -3     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0116.jpg",
                List.of(
                        "╔══ COMBAT ZONE ═══╗",
                        "║                  ║",
                        "║   ↓👨 : 📅 ► -3   ║",
                        "║   ↓🚀 : 👨 ► -2   ║",
                        "║   ↓🔫 : ⬆️ 💥⬆️    ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0117.jpg",
                List.of(
                        "╔═ ABANDONED SHIP ═╗",
                        "║                  ║",
                        "║      👨 ► -4     ║",
                        "║      💵 ► +6     ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0118.jpg",
                List.of(
                        "╔═ ABANDONED SHIP ═╗",
                        "║                  ║",
                        "║      👨 ► -5     ║",
                        "║      💵 ► +8     ║",
                        "║      📅 ► -2     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0119.jpg",
                List.of(
                        "╔═ ABAND. STATION ═╗",
                        "║                  ║",
                        "║      👨 ► ≥7     ║",
                        "║                  ║",
                        "║        🟥🟨       ║",
                        "║      📅 ► -1     ║",
                        "║                  ║",
                        "╚══════════════════╝",
                        ""
                ));
        asciiCards.put("GT-cards_2_0120.jpg",
                List.of(
                        "╔═ ABAND. STATION ═╗",
                        "║                  ║",
                        "║      👨 ► ≥8     ║",
                        "║                  ║",
                        "║      🟨🟨🟩       ║",
                        "║      📅 ► -2     ║",
                        "║                  ║",
                        "╚══════════════════╝"
                ));
    }

    public List<String> getCardAscii(String cardImagePath) {
        return asciiCards.get(cardImagePath);
    }
}